app/views/projects/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select :company_id, current_user.companies.order(:title), :id, :title, include_blank: true, :class => 'form-control' %>
---
SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ? ORDER BY "companies"."title" ASC  [["user_id", 2]]