app/controllers/companies_controller.rb

  def index
    @companies = current_user.companies.all
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? LIMIT ?  [["user_id", nil], ["LIMIT", 1]]

  def create
    #@company = Company.new(company_params)
    @company = current_user.companies.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Zimmermann Fenster und Türen"], ["description", "Ausbildungsstelle"], ["created_at", 2016-12-13 11:23:45 UTC], ["updated_at", 2016-12-13 11:23:45 UTC], ["user_id", 2]]

  def update
    respond_to do |format|
      if @company.update(company_params)
---
UPDATE "companies" SET "description" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["description", "Ausbildungsstelle Industriekaufmann"], ["updated_at", 2016-12-13 11:24:58 UTC], ["id", 7]]

  def destroy
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 5]]

  def set_company
    @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]