app/controllers/pages_controller.rb

SELECT "workdays".* FROM "workdays"
SELECT "projects".* FROM "projects"
SELECT "companies".* FROM "companies"
SELECT COUNT(*) FROM "companies"
---
  def index
    @workdays = Workday.all
    @projects = Project.all
    @companies = Company.all