app/controllers/projects_controller.rb

  def index
    #@projects = Project.all
    @projects = current_user.projects.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 2]]

  def create
    #@project = Project.new(project_params)
    @project = current_user.projects.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Homepage Sportverein"], ["description", ""], ["user_id", 2], ["created_at", 2016-12-13 11:58:50 UTC], ["updated_at", 2016-12-13 11:58:50 UTC]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]