app/controllers/workdays_controller.rb

  def index
    @workdays = current_user.workdays.all
---
SELECT "workdays".* FROM "workdays" WHERE "workdays"."user_id" = ?  [["user_id", 2]]

  def create
    @workday = current_user.workdays.new(workday_params)
    @workday.workingHours = ((@workday.end - @workday.start) * 24 * 60 * 60).to_i

    respond_to do |format|
      if @workday.save
---
INSERT INTO "workdays" ("day", "start", "end", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?)  [["day", Sun, 11 Dec 2016], ["start", 2016-12-11 18:40:00 UTC], ["end", 2016-12-11 18:40:00 UTC], ["created_at", 2016-12-11 18:40:39 UTC], ["updated_at", 2016-12-11 18:40:39 UTC], ["company_id", 2]]

  def update
    respond_to do |format|
      @workday.workingHours = ((@workday.end - @workday.start) * 24 * 60 * 60).to_i
      if @workday.update(workday_params)
---
UPDATE "workdays" SET "day" = ?, "updated_at" = ? WHERE "workdays"."id" = ?  [["day", Thu, 15 Dec 2016], ["updated_at", 2016-12-11 17:46:55 UTC], ["id", 1]]

  def destroy
    @workday.destroy
---
DELETE FROM "workdays" WHERE "workdays"."id" = ?  [["id", 2]]

  def set_workday
    @workday = Workday.find(params[:id])
---
SELECT  "workdays".* FROM "workdays" WHERE "workdays"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]