app/views/workdays/_form.html.erb

SELECT "companies".* FROM "companies" WHERE "companies"."user_id" = ? ORDER BY "companies"."title" ASC  [["user_id", 2]]
---
      <div class="col-lg-10">
        <%= f.collection_select :company_id, current_user.companies.order(:title), :id, :title, include_blank: true, :class => 'form-control' %>

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? ORDER BY "projects"."title" ASC  [["user_id", 2]]
---
      <div class="col-lg-10">
        <%= f.collection_select :project_id, current_user.projects.order(:title), :id, :title, include_blank: true, :class => 'form-control' %>